import React from 'react'
import style from './FooterSection.module.scss'



const FooterSection = () => {
   return (
      <footer className={style.footer} id="footer">
         <div className={style.footer__content}>
            <div className={style.container}>
               <form className={style.contactus} name="contactus" method="post">
                  <input className={style.contactus__number} id="phone-number" type="tel"
                     placeholder="Телефон" required />
                  <input className={style.contactus__name} type="text" name="name" placeholder="Ваше Имя" required />
                  <button className={style.contactus__btn} type="submit" name="phone">Заказать звонок</button>
               </form>
               <div className={style.contacts}>
                  <div className={style.contacts__hours}>
                     <h3 className={style.contacts__title}>
                        Наши контакты
                     </h3>
                     <div className={style.contacts__info}>
                        <div className={style.weekdays}>
                           <div className={style.weekdays__icon}>
                              <svg id="Layer_1" x="0px" y="0px" viewBox="0 0 240 240"
                                 // style={"enable-background:new 0 0 240 240"}
                                 xmlSpace="preserve">
                                 <g>
                                    <path
                                       d="M58.57,25.81c-2.13-3.67-0.87-8.38,2.8-10.51c3.67-2.13,8.38-0.88,10.51,2.8l9.88,17.1c2.13,3.67,0.87,8.38-2.8,10.51 c-3.67,2.13-8.38,0.88-10.51-2.8L58.57,25.81L58.57,25.81z M120,51.17c19.01,0,36.21,7.7,48.67,20.16 C181.12,83.79,188.83,101,188.83,120c0,19.01-7.7,36.21-20.16,48.67c-12.46,12.46-29.66,20.16-48.67,20.16 c-19.01,0-36.21-7.7-48.67-20.16C58.88,156.21,51.17,139.01,51.17,120c0-19.01,7.7-36.21,20.16-48.67 C83.79,58.88,101,51.17,120,51.17L120,51.17z M158.27,81.73c-9.79-9.79-23.32-15.85-38.27-15.85c-14.95,0-28.48,6.06-38.27,15.85 c-9.79,9.79-15.85,23.32-15.85,38.27c0,14.95,6.06,28.48,15.85,38.27c9.79,9.79,23.32,15.85,38.27,15.85 c14.95,0,28.48-6.06,38.27-15.85c9.79-9.79,15.85-23.32,15.85-38.27C174.12,105.05,168.06,91.52,158.27,81.73L158.27,81.73z M113.88,7.71c0-4.26,3.45-7.71,7.71-7.71c4.26,0,7.71,3.45,7.71,7.71v19.75c0,4.26-3.45,7.71-7.71,7.71 c-4.26,0-7.71-3.45-7.71-7.71V7.71L113.88,7.71z M170.87,19.72c2.11-3.67,6.8-4.94,10.48-2.83c3.67,2.11,4.94,6.8,2.83,10.48 l-9.88,17.1c-2.11,3.67-6.8,4.94-10.48,2.83c-3.67-2.11-4.94-6.8-2.83-10.48L170.87,19.72L170.87,19.72z M214.19,58.57 c3.67-2.13,8.38-0.87,10.51,2.8c2.13,3.67,0.88,8.38-2.8,10.51l-17.1,9.88c-3.67,2.13-8.38,0.87-10.51-2.8 c-2.13-3.67-0.88-8.38,2.8-10.51L214.19,58.57L214.19,58.57z M232.29,113.88c4.26,0,7.71,3.45,7.71,7.71 c0,4.26-3.45,7.71-7.71,7.71h-19.75c-4.26,0-7.71-3.45-7.71-7.71c0-4.26,3.45-7.71,7.71-7.71H232.29L232.29,113.88z M220.28,170.87 c3.67,2.11,4.94,6.8,2.83,10.48c-2.11,3.67-6.8,4.94-10.48,2.83l-17.1-9.88c-3.67-2.11-4.94-6.8-2.83-10.48 c2.11-3.67,6.8-4.94,10.48-2.83L220.28,170.87L220.28,170.87z M181.43,214.19c2.13,3.67,0.87,8.38-2.8,10.51 c-3.67,2.13-8.38,0.88-10.51-2.8l-9.88-17.1c-2.13-3.67-0.87-8.38,2.8-10.51c3.67-2.13,8.38-0.88,10.51,2.8L181.43,214.19 L181.43,214.19z M126.12,232.29c0,4.26-3.45,7.71-7.71,7.71c-4.26,0-7.71-3.45-7.71-7.71v-19.75c0-4.26,3.45-7.71,7.71-7.71 c4.26,0,7.71,3.45,7.71,7.71V232.29L126.12,232.29z M69.13,220.28c-2.11,3.67-6.8,4.94-10.48,2.83c-3.67-2.11-4.94-6.8-2.83-10.48 l9.88-17.1c2.11-3.67,6.8-4.94,10.48-2.83c3.67,2.11,4.94,6.8,2.83,10.48L69.13,220.28L69.13,220.28z M25.81,181.43 c-3.67,2.13-8.38,0.87-10.51-2.8c-2.13-3.67-0.88-8.38,2.8-10.51l17.1-9.88c3.67-2.13,8.38-0.87,10.51,2.8 c2.13,3.67,0.88,8.38-2.8,10.51L25.81,181.43L25.81,181.43z M7.71,126.12c-4.26,0-7.71-3.45-7.71-7.71c0-4.26,3.45-7.71,7.71-7.71 h19.75c4.26,0,7.71,3.45,7.71,7.71c0,4.26-3.45,7.71-7.71,7.71H7.71L7.71,126.12z M19.72,69.13c-3.67-2.11-4.94-6.8-2.83-10.48 c2.11-3.67,6.8-4.94,10.48-2.83l17.1,9.88c3.67,2.11,4.94,6.8,2.83,10.48c-2.11,3.67-6.8,4.94-10.48,2.83L19.72,69.13L19.72,69.13z" />
                                 </g>
                              </svg>
                           </div>
                           <div className={style.weekdays__info}>
                              <div className={style.weekdays__days}>
                                 Понедельник - Пятница
                              </div>
                              <div className={style.weekdays__hours}>
                                 09:00 - 18:00
                              </div>
                           </div>
                        </div>
                        <div className={style.weekdays}>
                           <div className={style.weekdays__icon}>
                              <svg version="1.1" id="Layer_1" x="0px" y="0px" viewBox="0 0 122.88 79.13"
                                 // style={"enable-background:new 0 0 122.88 79.13"} 
                                 xmlSpace="preserve">
                                 <g>
                                    <path
                                       d="M86.35,29.93c-0.75,0.37-1.51,0.78-2.26,1.21c-2.25,1.32-4.47,2.93-6.74,4.78l-4.84-5.54c1.67-1.55,3.48-2.96,5.4-4.21 c1.53-1,3.13-1.89,4.78-2.65c0.66-0.33,1.32-0.64,2-0.93c-3.19-5.65-7.78-9.7-12.98-12.2c-5.2-2.49-11.02-3.45-16.69-2.9 c-5.63,0.54-11.1,2.59-15.62,6.1c-5.23,4.05-9.2,10.11-10.73,18.14l-0.48,2.51l-2.5,0.44c-2.45,0.43-4.64,1.02-6.56,1.77 c-1.86,0.72-3.52,1.61-4.97,2.66c-1.16,0.84-2.16,1.78-3.01,2.8c-2.63,3.15-3.85,7.1-3.82,11.1c0.03,4.06,1.35,8.16,3.79,11.53 c0.91,1.25,1.96,2.4,3.16,3.4c1.22,1.01,2.59,1.85,4.13,2.48c1.53,0.63,3.22,1.08,5.09,1.34l72.55,0c3.53-0.85,6.65-2,9.3-3.48 c2.63-1.47,4.78-3.26,6.39-5.41c2.5-3.33,3.73-8.04,3.78-12.87c0.06-5.07-1.18-10.16-3.59-13.86c-0.69-1.07-1.45-2.03-2.25-2.89 c-3.61-3.89-8.19-5.59-12.95-5.62C93.3,27.6,89.73,28.43,86.35,29.93L86.35,29.93L86.35,29.93z M91.99,20.65 c1.6-0.25,3.2-0.38,4.79-0.36c6.72,0.05,13.2,2.45,18.3,7.95c1.07,1.15,2.08,2.45,3.03,3.9c3.2,4.92,4.84,11.49,4.77,17.92 c-0.07,6.31-1.77,12.59-5.25,17.21c-2.27,3.01-5.18,5.47-8.67,7.42c-3.36,1.88-7.28,3.31-11.68,4.33l-0.82,0.1l-73.08,0l-0.46-0.04 c-2.67-0.34-5.09-0.97-7.29-1.88c-2.27-0.94-4.28-2.15-6.05-3.63c-1.68-1.4-3.15-2.99-4.4-4.72C1.84,64.25,0.04,58.63,0,53.03 c-0.04-5.66,1.72-11.29,5.52-15.85c1.23-1.48,2.68-2.84,4.34-4.04c1.93-1.4,4.14-2.58,6.64-3.55c1.72-0.67,3.56-1.23,5.5-1.68 c2.2-8.74,6.89-15.47,12.92-20.14c5.64-4.37,12.43-6.92,19.42-7.59c6.96-0.67,14.12,0.51,20.55,3.6 C81.9,7.15,88.02,12.76,91.99,20.65L91.99,20.65L91.99,20.65z" />
                                 </g>
                              </svg>
                           </div>
                           <div className={style.weekdays__info}>
                              <div className={style.weekdays__days}>
                                 Суббота
                              </div>
                              <div className={style.weekdays__hours}>
                                 10:00 - 16:00
                              </div>
                           </div>
                        </div>
                     </div>
                  </div>
                  <div className={style.contacts__map}>
                     <iframe src={"https://yandex.ru/map-widget/v1/?um=constructor%3Ae39759799d6414336452a329fcb3e1f1ecfa10a833bbb8f9d0da76c7451f39c0&amp;source=constructor"} width={"100%"} height="612" frameborder="0"></iframe>
                     {/* <script type={"text/javascript"} charset={"utf-8"} async src={"https://api-maps.yandex.ru/services/constructor/1.0/js/?um=constructor%3Ae39759799d6414336452a329fcb3e1f1ecfa10a833bbb8f9d0da76c7451f39c0&amp;width=100%25&amp;height=720&amp;lang=ru_RU&amp;scroll=true"}></script> */}

                     {/* <script type={"text/javascript"} charset={"utf-8"} async src={"https://api-maps.yandex.ru/services/constructor/1.0/js/?um=constructor%3Ae39759799d6414336452a329fcb3e1f1ecfa10a833bbb8f9d0da76c7451f39c0&amp;width=100%25&amp;height=720&amp;lang=ru_RU&amp;scroll=true"}></script> */}
                     {/* <script type="text/javascript" charset="utf-8" async
                              src={"https://api-maps.yandex.ru/services/constructor/1.0/js/?um=constructor%3A9b9567a5e9d7ecf37e52d7276af26e35c5e46ebb09ffd56ca7a956b8dab683c8&amp;width=750&amp;height=400&amp;lang=ru_RU&amp;scroll=true"}></script> */}
                  </div>
               </div>
            </div>
         </div>
         <div className={style.footer__copyright_wrapper}>
            <div className={style.container}>
               <div className={style.footer__copyright}>
                  © 2023 Legal Advice. All Rights Reserved.
               </div>
            </div>
         </div>
      </footer>
   )
}

export default FooterSection